content/about_page.org
#+TITLE: About This Page

* Copyright

Copyright 2010--2024 Björn Lindström, except where stated otherwise.

Articles and images on this page are licensed under a [[https://creativecommons.org/licenses/by-sa/4.0/][Creative Commons Attribution-ShareAlike 4.0 International License]], except where stated otherwise.

* Design

This page is intentionally minimal and in particular inspired by these articles and designs:

- [[https://brutalist-web.design/][Guidelines for Brutalist Web Design]]
- [[https://web.archive.org/web/20210318102514/https://jrl.ninja/etc/1/][58 Bytes of CSS to Look Great Nearly Everywhere]]
- [[https://web.archive.org/web/20190508113905/https://emsenn.net/brutstrap.html][Brutstrap]]

  It should also look OK without CSS or in a text browser.

* Software

This page was created using the static site engine [[https://gohugo.io/][Hugo]].

* Hosting

This site is hosted at [[https://www.statichost.eu/][Statichost.eu]]:

#+begin_quote
Modern static site hosting with European servers and absolutely no personal data collection!
#+end_quote

* Source

The source code for this web site is available [[https://github.com/bkhl/elektrubadur.se][in this public GitHub repository]].
