about_page/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="https://elektrubadur.se/style.min.css">
<link href="https://elektrubadur.se/favicon.ico" rel="icon">
<link href="https://elektrubadur.se/favicon-16x16.png" rel="icon" sizes="16x16">
<link href="https://elektrubadur.se/favicon-96x96.png" rel="icon" sizes="96x96">
<link href="https://elektrubadur.se/favicon-192x192.png" rel="icon" sizes="192x192">
<link href="https://elektrubadur.se/favicon-32x32.png" rel="icon" sizes="32x32">
<title>About This Page – Elektrubadur</title>
<link rel="alternate" type="application/rss+xml" href="https://elektrubadur.se/rss.xml" title="Elektrubadur">
<link rel="sitemap" type="application/xml" title="Elektrubadur Sitemap" href="https://elektrubadur.se/sitemap.xml">
<link rel="me" href="https://social.sdfeu.org/@bkhl">
<meta name="description" content="Personal web page of Björn Lindström">
<meta name="author" content="Björn Lindström">
</head>
<body>
<header>
<h2><a href="https://elektrubadur.se/">Elektrubadur</a></h2>
<p><em>Personal web page of Björn Lindström</em></p>
</header>
<main>
<article>
<header>
<h1>About This Page</h1>
</header>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">Copyright</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Copyright 2010–2024 Björn Lindström, except where stated otherwise.</p>
<p>Articles and images on this page are licensed under a <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike 4.0 International License</a>, except where stated otherwise.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">Design</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>This page is intentionally minimal and in particular inspired by these articles and designs:</p>
<ul>
<li>
<a href="https://brutalist-web.design/">Guidelines for Brutalist Web Design</a>
</li>
<li>
<a href="https://web.archive.org/web/20210318102514/https://jrl.ninja/etc/1/">58 Bytes of CSS to Look Great Nearly Everywhere</a>
</li>
<li>
<a href="https://web.archive.org/web/20190508113905/https://emsenn.net/brutstrap.html">Brutstrap</a> It should also look OK without CSS or in a text browser.
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">Software</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>This page was created using the static site engine <a href="https://gohugo.io/">Hugo</a>.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">Hosting</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>This site is hosted at <a href="https://www.statichost.eu/">Statichost.eu</a>:</p>
<blockquote>
<p>Modern static site hosting with European servers and absolutely no personal data collection!</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">Source</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The source code for this web site is available <a href="https://github.com/bkhl/elektrubadur.se">in this public GitHub repository</a>.</p>
</div>
</div>
</article>
</main>
<footer>
<p>© 2010–2024 Björn Lindström</p>
</footer>
</body>
</html>
